zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cz_ca/pic32cz_ca90/pic32cz2051ca90176-pinctrl.h
/* pc8_gpio */
#define PC8_GPIO MCHP_PINMUX(c, 8, gpio, gpio)

/* pc8a_eic_extint8 */
#define PC8A_EIC_EXTINT8 MCHP_PINMUX(c, 8, a, periph)

/* pc8d_sercom2_pad0 */
#define PC8D_SERCOM2_PAD0 MCHP_PINMUX(c, 8, d, periph)

/* pc8e_ebi_ncs0 */
#define PC8E_EBI_NCS0 MCHP_PINMUX(c, 8, e, periph)

/* pc8f_tcc5_wo0 */
#define PC8F_TCC5_WO0 MCHP_PINMUX(c, 8, f, periph)

/* pc8h_sqi0_clk */
#define PC8H_SQI0_CLK MCHP_PINMUX(c, 8, h, periph)

/* pc8i_sdmmc0_sdck */
#define PC8I_SDMMC0_SDCK MCHP_PINMUX(c, 8, i, periph)

/* pc9_gpio */
#define PC9_GPIO MCHP_PINMUX(c, 9, gpio, gpio)

/* pc9a_eic_extint9 */
#define PC9A_EIC_EXTINT9 MCHP_PINMUX(c, 9, a, periph)

/* pc9d_sercom2_pad1 */
#define PC9D_SERCOM2_PAD1 MCHP_PINMUX(c, 9, d, periph)

/* pc9e_ebi_a22 */
#define PC9E_EBI_A22 MCHP_PINMUX(c, 9, e, periph)

/* pc9f_tcc5_wo1 */
#define PC9F_TCC5_WO1 MCHP_PINMUX(c, 9, f, periph)

/* pc9h_sqi0_data0 */
#define PC9H_SQI0_DATA0 MCHP_PINMUX(c, 9, h, periph)

/* pc9i_sdmmc0_sddat0 */
#define PC9I_SDMMC0_SDDAT0 MCHP_PINMUX(c, 9, i, periph)

/* pc10_gpio */
#define PC10_GPIO MCHP_PINMUX(c, 10, gpio, gpio)

/* pc10a_eic_extint10 */
#define PC10A_EIC_EXTINT10 MCHP_PINMUX(c, 10, a, periph)

/* pc10d_sercom2_pad2 */
#define PC10D_SERCOM2_PAD2 MCHP_PINMUX(c, 10, d, periph)

/* pc10e_ebi_a14 */
#define PC10E_EBI_A14 MCHP_PINMUX(c, 10, e, periph)

/* pc10f_tcc6_wo0 */
#define PC10F_TCC6_WO0 MCHP_PINMUX(c, 10, f, periph)

/* pc10h_sqi0_data1 */
#define PC10H_SQI0_DATA1 MCHP_PINMUX(c, 10, h, periph)

/* pc10i_sdmmc0_sddat1 */
#define PC10I_SDMMC0_SDDAT1 MCHP_PINMUX(c, 10, i, periph)

/* pc11_gpio */
#define PC11_GPIO MCHP_PINMUX(c, 11, gpio, gpio)

/* pc11a_eic_extint11 */
#define PC11A_EIC_EXTINT11 MCHP_PINMUX(c, 11, a, periph)

/* pc11d_sercom2_pad3 */
#define PC11D_SERCOM2_PAD3 MCHP_PINMUX(c, 11, d, periph)

/* pc11e_ebi_a13 */
#define PC11E_EBI_A13 MCHP_PINMUX(c, 11, e, periph)

/* pc11f_tcc6_wo1 */
#define PC11F_TCC6_WO1 MCHP_PINMUX(c, 11, f, periph)

/* pc11h_sqi0_data2 */
#define PC11H_SQI0_DATA2 MCHP_PINMUX(c, 11, h, periph)

/* pc11i_sdmmc0_sddat2 */
#define PC11I_SDMMC0_SDDAT2 MCHP_PINMUX(c, 11, i, periph)

/* pc12_gpio */
#define PC12_GPIO MCHP_PINMUX(c, 12, gpio, gpio)

/* pc12a_eic_extint12 */
#define PC12A_EIC_EXTINT12 MCHP_PINMUX(c, 12, a, periph)

/* pc12d_sercom3_pad0 */
#define PC12D_SERCOM3_PAD0 MCHP_PINMUX(c, 12, d, periph)

/* pc12e_ebi_a9 */
#define PC12E_EBI_A9 MCHP_PINMUX(c, 12, e, periph)

/* pc12f_tcc4_wo0 */
#define PC12F_TCC4_WO0 MCHP_PINMUX(c, 12, f, periph)

/* pc12h_sqi0_data3 */
#define PC12H_SQI0_DATA3 MCHP_PINMUX(c, 12, h, periph)

/* pc12i_sdmmc0_sddat3 */
#define PC12I_SDMMC0_SDDAT3 MCHP_PINMUX(c, 12, i, periph)

/* pc13_gpio */
#define PC13_GPIO MCHP_PINMUX(c, 13, gpio, gpio)

/* pc13a_eic_extint13 */
#define PC13A_EIC_EXTINT13 MCHP_PINMUX(c, 13, a, periph)

/* pc13d_sercom3_pad1 */
#define PC13D_SERCOM3_PAD1 MCHP_PINMUX(c, 13, d, periph)

/* pc13e_ebi_a8 */
#define PC13E_EBI_A8 MCHP_PINMUX(c, 13, e, periph)

/* pc13f_tcc4_wo1 */
#define PC13F_TCC4_WO1 MCHP_PINMUX(c, 13, f, periph)

/* pc13h_sqi0_cs0 */
#define PC13H_SQI0_CS0 MCHP_PINMUX(c, 13, h, periph)

/* pc13i_sdmmc0_sdcmd */
#define PC13I_SDMMC0_SDCMD MCHP_PINMUX(c, 13, i, periph)

/* pc14_gpio */
#define PC14_GPIO MCHP_PINMUX(c, 14, gpio, gpio)

/* pc14a_eic_extint14 */
#define PC14A_EIC_EXTINT14 MCHP_PINMUX(c, 14, a, periph)

/* pc14d_sercom3_pad2 */
#define PC14D_SERCOM3_PAD2 MCHP_PINMUX(c, 14, d, periph)

/* pc14e_ebi_a6 */
#define PC14E_EBI_A6 MCHP_PINMUX(c, 14, e, periph)

/* pc14f_tcc8_wo0 */
#define PC14F_TCC8_WO0 MCHP_PINMUX(c, 14, f, periph)

/* pc14i_sdmmc0_sdwp */
#define PC14I_SDMMC0_SDWP MCHP_PINMUX(c, 14, i, periph)

/* pc15_gpio */
#define PC15_GPIO MCHP_PINMUX(c, 15, gpio, gpio)

/* pc15a_eic_extint15 */
#define PC15A_EIC_EXTINT15 MCHP_PINMUX(c, 15, a, periph)

/* pc15d_sercom3_pad3 */
#define PC15D_SERCOM3_PAD3 MCHP_PINMUX(c, 15, d, periph)

/* pc15e_ebi_a5 */
#define PC15E_EBI_A5 MCHP_PINMUX(c, 15, e, periph)

/* pc15f_tcc8_wo1 */
#define PC15F_TCC8_WO1 MCHP_PINMUX(c, 15, f, periph)

/* pc15h_sqi0_cs1 */
#define PC15H_SQI0_CS1 MCHP_PINMUX(c, 15, h, periph)

/* pc15i_sdmmc0_sdcd */
#define PC15I_SDMMC0_SDCD MCHP_PINMUX(c, 15, i, periph)

/* pc17_gpio */
#define PC17_GPIO MCHP_PINMUX(c, 17, gpio, gpio)

/* pc17g_bsdap_tdi */
#define PC17G_BSDAP_TDI MCHP_PINMUX(c, 17, g, periph)

/* pc18_gpio */
#define PC18_GPIO MCHP_PINMUX(c, 18, gpio, gpio)

/* pc18g_bsdap_tms_swdio */
#define PC18G_BSDAP_TMS_SWDIO MCHP_PINMUX(c, 18, g, periph)

/* pc19_gpio */
#define PC19_GPIO MCHP_PINMUX(c, 19, gpio, gpio)

/* pc19g_bsdap_tdo */
#define PC19G_BSDAP_TDO MCHP_PINMUX(c, 19, g, periph)

/* pc20_gpio */
#define PC20_GPIO MCHP_PINMUX(c, 20, gpio, gpio)

/* pc20g_bsdap_tck_swclk */
#define PC20G_BSDAP_TCK_SWCLK MCHP_PINMUX(c, 20, g, periph)

/* pc21_gpio */
#define PC21_GPIO MCHP_PINMUX(c, 21, gpio, gpio)

/* pc21a_eic_extint5 */
#define PC21A_EIC_EXTINT5 MCHP_PINMUX(c, 21, a, periph)

/* pc21d_sercom4_pad0 */
#define PC21D_SERCOM4_PAD0 MCHP_PINMUX(c, 21, d, periph)

/* pc21e_ebi_ncs3 */
#define PC21E_EBI_NCS3 MCHP_PINMUX(c, 21, e, periph)

/* pc21f_tcc6_wo0 */
#define PC21F_TCC6_WO0 MCHP_PINMUX(c, 21, f, periph)

/* pc22_gpio */
#define PC22_GPIO MCHP_PINMUX(c, 22, gpio, gpio)

/* pc22a_eic_extint6 */
#define PC22A_EIC_EXTINT6 MCHP_PINMUX(c, 22, a, periph)

/* pc22d_sercom4_pad1 */
#define PC22D_SERCOM4_PAD1 MCHP_PINMUX(c, 22, d, periph)

/* pc22e_ebi_ncs2 */
#define PC22E_EBI_NCS2 MCHP_PINMUX(c, 22, e, periph)

/* pc22f_tcc6_wo1 */
#define PC22F_TCC6_WO1 MCHP_PINMUX(c, 22, f, periph)

/* pc23_gpio */
#define PC23_GPIO MCHP_PINMUX(c, 23, gpio, gpio)

/* pc23a_eic_extint7 */
#define PC23A_EIC_EXTINT7 MCHP_PINMUX(c, 23, a, periph)

/* pc23d_sercom4_pad2 */
#define PC23D_SERCOM4_PAD2 MCHP_PINMUX(c, 23, d, periph)

/* pc23e_ebi_nbs0_a0 */
#define PC23E_EBI_NBS0_A0 MCHP_PINMUX(c, 23, e, periph)

/* pc23f_tcc5_wo0 */
#define PC23F_TCC5_WO0 MCHP_PINMUX(c, 23, f, periph)

/* pc24_gpio */
#define PC24_GPIO MCHP_PINMUX(c, 24, gpio, gpio)

/* pc24a_eic_extint8 */
#define PC24A_EIC_EXTINT8 MCHP_PINMUX(c, 24, a, periph)

